###################################################################

# Created by write_sdc on Fri Apr 16 22:16:06 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 5 [get_ports {cipher[31]}]
set_load -pin_load 5 [get_ports {cipher[30]}]
set_load -pin_load 5 [get_ports {cipher[29]}]
set_load -pin_load 5 [get_ports {cipher[28]}]
set_load -pin_load 5 [get_ports {cipher[27]}]
set_load -pin_load 5 [get_ports {cipher[26]}]
set_load -pin_load 5 [get_ports {cipher[25]}]
set_load -pin_load 5 [get_ports {cipher[24]}]
set_load -pin_load 5 [get_ports {cipher[23]}]
set_load -pin_load 5 [get_ports {cipher[22]}]
set_load -pin_load 5 [get_ports {cipher[21]}]
set_load -pin_load 5 [get_ports {cipher[20]}]
set_load -pin_load 5 [get_ports {cipher[19]}]
set_load -pin_load 5 [get_ports {cipher[18]}]
set_load -pin_load 5 [get_ports {cipher[17]}]
set_load -pin_load 5 [get_ports {cipher[16]}]
set_load -pin_load 5 [get_ports {cipher[15]}]
set_load -pin_load 5 [get_ports {cipher[14]}]
set_load -pin_load 5 [get_ports {cipher[13]}]
set_load -pin_load 5 [get_ports {cipher[12]}]
set_load -pin_load 5 [get_ports {cipher[11]}]
set_load -pin_load 5 [get_ports {cipher[10]}]
set_load -pin_load 5 [get_ports {cipher[9]}]
set_load -pin_load 5 [get_ports {cipher[8]}]
set_load -pin_load 5 [get_ports {cipher[7]}]
set_load -pin_load 5 [get_ports {cipher[6]}]
set_load -pin_load 5 [get_ports {cipher[5]}]
set_load -pin_load 5 [get_ports {cipher[4]}]
set_load -pin_load 5 [get_ports {cipher[3]}]
set_load -pin_load 5 [get_ports {cipher[2]}]
set_load -pin_load 5 [get_ports {cipher[1]}]
set_load -pin_load 5 [get_ports {cipher[0]}]
create_clock [get_ports clock]  -name CLK  -period 8  -waveform {0 4}
set_max_delay 20  -from [get_ports reset]
set_input_delay -clock CLK  -max 0.8  [get_ports clock]
set_input_delay -clock CLK  -max 0.8  [get_ports reset]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {input[0]}]
set_input_delay -clock CLK  -max 0.8  [get_ports mr]
set_input_delay -clock CLK  -max 0.8  [get_ports mw]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[31]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[30]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[29]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[28]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[27]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[26]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[25]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[24]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[23]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[22]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[21]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[20]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[19]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[18]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[17]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[16]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[15]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[14]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[13]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[12]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[11]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[10]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[9]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[8]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[7]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[6]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[5]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[4]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[3]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[2]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[1]}]
set_input_delay -clock CLK  -max 0.8  [get_ports {keyOrPlain[0]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[31]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[30]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[29]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[28]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[27]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[26]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[25]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[24]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[23]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[22]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[21]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[20]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[19]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[18]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[17]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[16]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[15]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[14]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[13]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[12]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[11]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[10]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[9]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[8]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[7]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[6]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[5]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[4]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[3]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[2]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[1]}]
set_output_delay -clock CLK  -max 0.8  [get_ports {cipher[0]}]
set_input_transition -max 0.1  [get_ports reset]
set_input_transition -max 0.1  [get_ports clock]
set_input_transition -max 0.1  [get_ports {input[31]}]
set_input_transition -max 0.1  [get_ports {input[30]}]
set_input_transition -max 0.1  [get_ports {input[29]}]
set_input_transition -max 0.1  [get_ports {input[28]}]
set_input_transition -max 0.1  [get_ports {input[27]}]
set_input_transition -max 0.1  [get_ports {input[26]}]
set_input_transition -max 0.1  [get_ports {input[25]}]
set_input_transition -max 0.1  [get_ports {input[24]}]
set_input_transition -max 0.1  [get_ports {input[23]}]
set_input_transition -max 0.1  [get_ports {input[22]}]
set_input_transition -max 0.1  [get_ports {input[21]}]
set_input_transition -max 0.1  [get_ports {input[20]}]
set_input_transition -max 0.1  [get_ports {input[19]}]
set_input_transition -max 0.1  [get_ports {input[18]}]
set_input_transition -max 0.1  [get_ports {input[17]}]
set_input_transition -max 0.1  [get_ports {input[16]}]
set_input_transition -max 0.1  [get_ports {input[15]}]
set_input_transition -max 0.1  [get_ports {input[14]}]
set_input_transition -max 0.1  [get_ports {input[13]}]
set_input_transition -max 0.1  [get_ports {input[12]}]
set_input_transition -max 0.1  [get_ports {input[11]}]
set_input_transition -max 0.1  [get_ports {input[10]}]
set_input_transition -max 0.1  [get_ports {input[9]}]
set_input_transition -max 0.1  [get_ports {input[8]}]
set_input_transition -max 0.1  [get_ports {input[7]}]
set_input_transition -max 0.1  [get_ports {input[6]}]
set_input_transition -max 0.1  [get_ports {input[5]}]
set_input_transition -max 0.1  [get_ports {input[4]}]
set_input_transition -max 0.1  [get_ports {input[3]}]
set_input_transition -max 0.1  [get_ports {input[2]}]
set_input_transition -max 0.1  [get_ports {input[1]}]
set_input_transition -max 0.1  [get_ports {input[0]}]
set_input_transition -max 0.1  [get_ports mr]
set_input_transition -max 0.1  [get_ports mw]
set_input_transition -max 0.1  [get_ports {keyOrPlain[31]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[30]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[29]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[28]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[27]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[26]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[25]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[24]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[23]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[22]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[21]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[20]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[19]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[18]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[17]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[16]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[15]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[14]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[13]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[12]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[11]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[10]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[9]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[8]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[7]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[6]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[5]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[4]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[3]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[2]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[1]}]
set_input_transition -max 0.1  [get_ports {keyOrPlain[0]}]
